Revit 2026 API

# ColumnAttachmentRemoveColumnAttachment(FamilyInstance, Int32) Method

---

Removes an attachment at the top or base of a column, if there is one.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void RemoveColumnAttachment(
	FamilyInstance column,
	int baseOrTop
)
```
```vb
Public Shared Sub RemoveColumnAttachment (
	column As FamilyInstance,
	baseOrTop As Integer
)
```
```cpp
public:
static void RemoveColumnAttachment(
	FamilyInstance^ column,
	int baseOrTop
)
```
```fsharp
static member RemoveColumnAttachment :
        column : FamilyInstance *
        baseOrTop : int -> unit
```

#### Parameters

column FamilyInstance
     A column.
baseOrTop Int32
     0 for base, 1 for top.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | baseOrTop must be either 0 or 1. |

This method modifies both column and target elements.

#### Reference

ColumnAttachment Class

RemoveColumnAttachment Overload

Autodesk.Revit.DB Namespace